КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СертификатыЭлектроннойПодписи/КонтурЛогистика_СертификатыЭлектроннойПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_СертификатыЭлектроннойПодписи</name>
  <attributes>
    <name>ОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСертификата</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиТипаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладельцаСертификата</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатВыдан</name>
    <comment>Кому выдан сертификат: ЮЛ, ФЛ, ИП</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПодписания/КонтурЛогистика_НастройкиПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПодписания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдалитьОтпечатокСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <comment>Используется только если не настроена должность в сертификате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьМЧД</name>
    <comment>Единый регистрационный номер доверенности, Уникальный идентификатор доверенности в виде 36-разрядного GUID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИдСистХран</name>
    <comment>ИдСистХран - Идентифицирующие сведения об информационной системе, в которой хранится доверенность, используемая для подтверждения полномочий в электронной форме (СвСистХран для некоторых сообщений)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатусПодписанта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИздатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДатаВыпускаМЧД</name>
    <comment>в драфте 5.02 более нет необходимости указывать дату доверки в титуле</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ДатаДовер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СвДоверБум_ВнНомДовер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьТипМодуляКриптографии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьИмяМодуляКриптографии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВводитьПарольВПрограммеЭлектроннойПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_СертификатыЭлектроннойПодписи</types>
    </type>
  </resources>
  <resources>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_МЧД</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатБезМЧД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСведенияОПодписанте</name>
    <comment>Дополнительные сведения о подписанте</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщийСпособПодтвержденияПолномочий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ОбщиеСпособыПодтвержденияПолномочий</types>
    </type>
  </resources>
  <resources>
    <name>ИсключениеДляОтдельныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>taskIdRegisterPOA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНастройки</name>
    <comment>Для метрик</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <comment>не заполнен - общее значение для организации</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СертификатНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыПодписи/КонтурЛогистика_ТипыПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПодписи</name>
  <enumValues>
    <name>УКЭП</name>
  </enumValues>
  <enumValues>
    <name>ПЭП</name>
  </enumValues>
  <enumValues>
    <name>УНЭП</name>
  </enumValues>
  <enumValues>
    <name>Тестовая</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛиц/КонтурЛогистика_ТипыЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛиц</name>
  <enumValues>
    <name>ИП</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИностранныйФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ОрганИсполнительнойВласти</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СертификатыЭлектроннойПодписи/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		
		ЭтоНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
		
		Если ЭтоНовый Тогда
			
			ПроверкаПройдена = Ложь;
			
			Если Параметры.ДополнительныеПараметры.Свойство("ДанныеСертификата") Тогда
				
				ДанныеСертификата = Параметры.ДополнительныеПараметры.ДанныеСертификата;
				ЗаполнитьСертификатДанными(ДанныеСертификата);
				
				ТекстПредупреждения = "Необходимо выполнить проверку сертификата!";
				
			Иначе
				
				Отказ = Истина;
				
			КонецЕсли;
			
			ЗаполнитьТипПрограммыЭППоУмолчанию();
			
		Иначе
			
			ПроверкаПройдена = Истина;
			ТекстПредупреждения = "Проверка пройдена";
			
			ЗначениеПЗК = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьПароль(Объект.Ссылка, "ПЗК");
			ПЗК = ?(ЗначениеЗаполнено(ЗначениеПЗК), Строка(УникальныйИдентификатор), "");
			
			текОбъект = РеквизитФормыВЗначение("Объект");
			текОбъект.ОбновитьТипПодписиЧерезДиадок();
			Прочитать();
			
			Элементы.ТекстДатаПроверкиТипаПодписи.Заголовок = "(на " + Строка(Объект.ДатаПроверкиТипаПодписи) + ")";
			
		КонецЕсли;
		
		ПроверитьСрокДействия();
		
		ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
			Или РольДоступна("КонтурЛогистика_НастройкаПодписания"));
		
		Если Не ТекПользовательПродвинутый И Не ЭтоНовый Тогда 
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ПЗК.ТолькоПросмотр = Истина;
			Элементы.ТипПрограммыЭП.ТолькоПросмотр = Истина;
			Элементы.ФормаПроверитьСертификат.Доступность = Ложь;
			Элементы.ФормаПерезаполнитьПоОтпечатку.Доступность = Ложь;
			
		КонецЕсли;
		
		Элементы.МестоположениеСертификата.Заголовок = ?(Объект.СертификатНаСервере, "- на сервере", "- на клиенте");
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("СертификатыЭлектроннойПодписи", ИнформацияОбОшибке(), Объект.Ссылка);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьФорму();
	
	Если ЭтоНовый Тогда
		
		Модифицированность = Истина;
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда 
			
			ПолучитьДвоичныеДанныеСертификатаСинх();
			
		Иначе
		
			#Если Не ТолстыйКлиентОбычноеПриложение И Не ТолстыйКлиентУправляемоеПриложение Тогда
				
				Если Объект.СертификатНаСервере Тогда
					ПолучитьДвоичныеДанныеСертификатаНаСервере();
				Иначе				
					ПолучитьДвоичныеДанныеСертификатаНаКлиенте();																	
				КонецЕсли;
																	
			#Иначе
							
				ПолучитьДвоичныеДанныеСертификатаСинх();
				
			#КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПроверкаПройдена И КонтурЛогистика_КриптографияКлиентПовтИсп.ТипПлатформыWindows() Тогда
		Сообщить("Проверка электронной подписи не выполнена");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоНовый И ЗначениеЗаполнено(АдресСертификата) Тогда
		ДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
		ТекущийОбъект.ДанныеСертификата = Новый ХранилищеЗначения(ДанныеСертификата);
	ИначеЕсли Не ЗначениеЗаполнено(ТекущийОбъект.ДанныеСертификата.Получить()) И ЗначениеЗаполнено(АдресСертификата) Тогда
		ДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
		ТекущийОбъект.ДанныеСертификата = Новый ХранилищеЗначения(ДанныеСертификата);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПарольИзменен Тогда
		КонтурЛогистика_ОбщегоНазначенияВызовСервера.ЗаписатьПароль(ТекущийОбъект.Ссылка, ПЗК, "ПЗК");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ОбновитьНастройкиПодписанияВСтартовомПомощнике");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПроверитьСрокДействия()
	
	ИстекаетЧерез = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазницаВДнях(Объект.СрокДействия, ТекущаяДатаСеанса());
	
	Если ИстекаетЧерез < 0 Тогда
		Элементы.ГруппаПредупреждениеСрокДействия.Видимость = Истина;
		Элементы.ПредупреждениеСрокДействия.Заголовок = "Срок действия сертификата истек!"
	ИначеЕсли ИстекаетЧерез = 0 Тогда
		Элементы.ГруппаПредупреждениеСрокДействия.Видимость = Истина;
		Элементы.ПредупреждениеСрокДействия.Заголовок = "Срок действия сертификата истекает сегодня!"
	ИначеЕсли ИстекаетЧерез > 0 И ИстекаетЧерез <= 30 Тогда
		Элементы.ГруппаПредупреждениеСрокДействия.Видимость = Истина;
		Элементы.ПредупреждениеСрокДействия.Заголовок = "Срок действия сертификата истекает через " + Строка(ИстекаетЧерез) + " дней!";
	Иначе
		Элементы.ГруппаПредупреждениеСрокДействия.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводитьПарольВПрограммеЭлектроннойПодписиПриИзменении(Элемент)

	Если Объект.ВводитьПарольВПрограммеЭлектроннойПодписи Тогда		
		ПЗК = "";
		Элементы.ПЗК.Доступность = Ложь;				
	Иначе		
		Элементы.ПЗК.Доступность = Истина;		
	КонецЕсли;
	
	ПроверкаПройдена = Ложь;
	ТекстПредупреждения = "Изменились настройки программы ЭП. Необходимо выполнить проверку сертификата!";
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеСертификата(Команда)
	
	ДополнительныеПараметры = Новый Структура;
				
	КомуВыдан = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	
	ДополнительныеПараметры.Вставить("СертификатСсылка", Объект.Ссылка);
	ДополнительныеПараметры.Вставить("АдресСертификата", АдресСертификата);
	ДополнительныеПараметры.Вставить("КомуВыдан", КомуВыдан);
	ДополнительныеПараметры.Вставить("КемВыдан", Объект.Издатель);
	ДополнительныеПараметры.Вставить("Истекает", Объект.СрокДействия);
	
	ОткрытьФорму("Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ДанныеСертификата", ДополнительныеПараметры, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
		
КонецПроцедуры

&НаКлиенте
Процедура ПЗКПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
	Если ПроверкаПройдена Тогда
	
		ПроверкаПройдена = Ложь;
		ТекстПредупреждения = "Изменен пароль. Необходимо выполнить проверку сертификата!";
		УправлениеЭлементамиФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСертификат(Команда)
	
	Если ПустаяСтрока(ТипПрограммыЭП) Тогда
		
		Сообщить("Тип программы ЭП не выбран!");
		Возврат;
		
	КонецЕсли;
	
	Если Не КонтурЛогистика_КриптографияКлиентПовтИсп.ТипПлатформыWindows() Тогда
		                                                              
		Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
		ПоказатьПредупреждение(Оповещение, "Проверка не работает в " + КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипПлатформы());
		
		Возврат;
		
	КонецЕсли;

	ЗначениеПЗК = ПолучитьПЗК();
	
	#Если ВебКлиент Тогда
		
		Если Объект.СертификатНаСервере Или КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда
			
			Результат = ВыполнитьПроверкуСертификата(ЗначениеПЗК, Истина);
			ОбработатьРезультатПроверкиСертификата(Результат);
			
		Иначе
			
			ОповещениеПроверкаПодписи = Новый ОписаниеОповещения("ПроверкаПодписиЗавершение", ЭтаФорма, Новый Структура(), "ПроверкаПодписиЗавершениеОшибка", ЭтаФорма);
			ОповещениеИнициализацииМенеджераКриптографии = Новый ОписаниеОповещения("НачатьИнициализациюМенеджераКриптографииЗавершение", ЭтаФорма, Новый Структура,
				"НачатьИнициализациюМенеджераКриптографииОшибка", ЭтаФорма);
		
			ДополнительныеПараметры = Новый Структура;		
			ДополнительныеПараметры.Вставить("ОповещениеИнициализацииМенеджераКриптографии", ОповещениеИнициализацииМенеджераКриптографии);
			ДополнительныеПараметры.Вставить("ОповещениеПроверкаПодписи", ОповещениеПроверкаПодписи);
			ДополнительныеПараметры.Вставить("ЗначениеПЗК", ЗначениеПЗК);
			
			ВыполнитьПроверкуСертификата(ЗначениеПЗК, , ДополнительныеПараметры);
			
		КонецЕсли;
		
	#Иначе
	
		Результат = ВыполнитьПроверкуСертификата(ЗначениеПЗК, Истина);
		ОбработатьРезультатПроверкиСертификата(Результат);
		
	#КонецЕсли
	 				
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПроверкуСертификата(ЗначениеПЗК, ВернутьОшибку = Ложь, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Неопределено;
	ИспользоватьКриптографию1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьКриптографию1С");
	
	#Если ВебКлиент Тогда
		
		Если Объект.СертификатНаСервере Или КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда
			Результат = ПроверитьСертификатНаСервере(ЗначениеПЗК, ИспользоватьКриптографию1С, ВернутьОшибку);
			Возврат Результат;
		Иначе
			Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСКриптографиейПодключено", ЭтаФорма, ДополнительныеПараметры);	
			НачатьПодключениеРасширенияРаботыСКриптографией(Оповещение);
		КонецЕсли;
		
	#Иначе
		
		Если Объект.СертификатНаСервере Или
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда
			Результат = ПроверитьСертификатНаСервере(ЗначениеПЗК, ИспользоватьКриптографию1С, ВернутьОшибку);	
		Иначе				
			Результат = ПроверитьСертификатНаКлиенте(ЗначениеПЗК, ИспользоватьКриптографию1С, ВернутьОшибку);				
		КонецЕсли;
		
		ПроверитьСертификатЧерезДиадок();
	    
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Функция ПроверитьСертификатНаКлиенте(ЗначениеПЗК, ИспользоватьКриптографию1С, ВернутьОшибку = Ложь)
		
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = КаталогВременныхФайлов() + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяПромежуточногоФайла);
	
	Если ИспользоватьКриптографию1С Тогда
	
		Результат = КонтурЛогистика_КриптографияКлиентСервер.ПодписатьДанные(ДвоичныеДанные, Объект.ОтпечатокСертификата, ЗначениеПЗК, 
			Объект.ТипМодуляКриптографии, Объект.ВводитьПарольВПрограммеЭлектроннойПодписи, , ВернутьОшибку);
			
		Иначе
			
			Попытка
									
				МодульКлиента = Вычислить("КонтурЛогистика_ИнтеграцияДиадокКлиент");
				
			Исключение
				
				Сообщить("Не удалось получить данные подписи."); 
								
			КонецПопытки;
			
			Результат = МодульКлиента.ПодписатьФайлОбмена(ДвоичныеДанные, Объект.ОтпечатокСертификата, ЗначениеПЗК, ,ВернутьОшибку);
	
	КонецЕсли;
															
	УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Возврат Результат;
															
КонецФункции

&НаСервере
Функция ПроверитьСертификатНаСервере(ЗначениеПЗК, ИспользоватьКриптографию1С, ВернутьОшибку = Ложь)
		
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = КаталогВременныхФайлов() + ИмяФайла;
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяПромежуточногоФайла);
	
	Если ИспользоватьКриптографию1С Тогда
	
		Результат = КонтурЛогистика_КриптографияСервер.ПодписатьДанные(ДвоичныеДанные, Объект.ОтпечатокСертификата, ЗначениеПЗК, 
			Объект.ТипМодуляКриптографии, Объект.ВводитьПарольВПрограммеЭлектроннойПодписи,, ВернутьОшибку);
																
	Иначе
			
		Результат = КонтурЛогистика_ИнтеграцияДиадокСервер.ПодписатьФайлОбмена(
			ДвоичныеДанные, Объект.ОтпечатокСертификата, ЗначениеПЗК,, ВернутьОшибку);
																		
	КонецЕсли;														
															
	УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Возврат Результат;
	
КонецФункции
 				
&НаКлиенте
Процедура ИнформацияПоПрограммамЭП(Команда)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ИнформацияПоПрограммамЭПНаСервере(ТабДокумент);	
	
	Параметрыформы = Новый Структура;
	Параметрыформы.Вставить("ТабДокумент", ТабДокумент);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
					"Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи.Форма.ИнформацияПоПрограммамЭП",
					Параметрыформы,
					ЭтаФорма,
					ЭтаФорма, 
					, 
					, 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрограммыЭПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ИмяДляВыбора = ВыбранноеЗначение Тогда
			
			ПроверкаПройдена = Объект.ИмяМодуляКриптографии = ТипМодуля.ИмяМодуляКриптографии;
			
			Объект.ТипМодуляКриптографии = ТипМодуля.ТипМодуляКриптографии;			 
			Объект.ИмяМодуляКриптографии = ТипМодуля.ИмяМодуляКриптографии;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстПредупреждения = "Изменилась программа ЭП. Необходимо выполнить проверку сертификата!";
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоОтпечатку(Команда)
			
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Вы уверены, что хотите перезаполнить сертификат по отпечатку", РежимДиалогаВопрос.ДаНет) 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипСертификатаИзДиадока(Команда)
	
	ПроверитьСертификатЧерезДиадок();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьФорму()
		
	ЗаполнитьСписокТиповМодуляКриптографииДляВыбора();
	ЗаполнитьТипПрограммыЭППриОткрытии();
	
	КомуВыдан = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияПоПрограммамЭПНаСервере(ТабДокумент)
	
	_Объект = РеквизитФормыВЗначение("Объект");
		
	Макет = _Объект.ПолучитьМакет("ПрограммыЭП");
	
	ТаблицаПрограмм = Макет.ПолучитьОбласть("ТаблицаПрограмм");
	ТабДокумент.Вывести(ТаблицаПрограмм);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСертификатДанными(ДанныеСертификата)
		
	ЗаполнитьЗначенияСвойств(Объект, ДанныеСертификата);
	
	Объект.Наименование = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.СформироватьНаименованиеСертификата(Объект);
	
	Если Не ЗначениеЗаполнено(Объект.Должность) Тогда
		Объект.Должность = "Сотрудник";	
	КонецЕсли;
	
	Если ДанныеСертификата.Свойство("Издатель") 
		И Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ЭтоТестовыйСертификат(ДанныеСертификата.Издатель, ДанныеСертификата.ИздательИНН, ДанныеСертификата.ИздательОГРН) Тогда
		Объект.ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.Тестовая;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()	
	
	Если Объект.ТипВладельцаСертификата = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ЮрЛицо") Или ЗначениеЗаполнено(Объект.ИННЮЛ) Тогда
		Элементы.Организация.Видимость = Истина;
		Элементы.ИННЮЛ.Видимость = Истина;		
	Иначе
		Элементы.Организация.Видимость = Ложь;
		Элементы.ИННЮЛ.Видимость = Ложь;		
	КонецЕсли;
		
	Элементы.ОГРНИП.Видимость = Объект.ТипВладельцаСертификата = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛиц.ИП") Или ЗначениеЗаполнено(Объект.ОГРНИП);
	
	Элементы.СНИЛС.Видимость = ЗначениеЗаполнено(Объект.СНИЛС);
	
	Элементы.ФормаПерезаполнитьПоОтпечатку.Видимость = Не ЭтоНовый;
	
	Если ПроверкаПройдена Тогда
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.ГруппаПредупреждение.ЦветФона = Новый Цвет();
		Элементы.Предупреждение.ЦветТекста = Новый Цвет(0, 128, 0);
		Элементы.ПроверкаПройденаКартинка.Видимость = Истина;
		Элементы.ПредупреждениеКартинка.Видимость = Ложь;
		Элементы.Предупреждение.Заголовок = ТекстПредупреждения;
		Элементы.ФормаПроверитьСертификат.Заголовок = "Перепроверить";
		Элементы.ФормаПроверитьСертификат.КнопкаПоУмолчанию = Ложь;
		Элементы.Предупреждение.РастягиватьПоГоризонтали = Ложь;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.ГруппаПредупреждение.ЦветФона = Новый Цвет(251, 237, 158);
		Элементы.Предупреждение.ЦветТекста = Новый Цвет();
		Элементы.ПредупреждениеКартинка.Видимость = Истина;
		Элементы.ПроверкаПройденаКартинка.Видимость = Ложь;
		Элементы.Предупреждение.Заголовок = ТекстПредупреждения;
		Элементы.ФормаПроверитьСертификат.Заголовок = "Проверить";
		Элементы.ФормаПроверитьСертификат.КнопкаПоУмолчанию = Истина;
		Элементы.Предупреждение.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
	Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
	
	Элементы.ГруппаТипПодписи.Видимость = Объект.ТипПодписи <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПодписи.ПустаяСсылка");
	Элементы.ОбновитьТипСертификатаИзДиадока.Видимость = Объект.ТипПодписи <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПодписи.Тестовая");  
	Элементы.ТекстДатаПроверкиТипаПодписи.Видимость = Объект.ТипПодписи <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПодписи.Тестовая");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПЗК()
	
	Если ПарольИзменен Или ЭтоНовый Тогда
		Возврат ПЗК;
	Иначе
		Возврат КонтурЛогистика_ОбщегоНазначенияВызовСервера.ПолучитьПароль(Объект.Ссылка, "ПЗК");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ДвоичныеДанныеСертификата

&НаКлиенте
Процедура ПолучитьДвоичныеДанныеСертификатаСинх()
	
	Если Объект.СертификатНаСервере Тогда
		ПолучитьДвоичныеДанныеСертификатаНаСервере();
	Иначе				
		ПолучитьДвоичныеДанныеСертификатаНаКлиентеСинхр();																	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДвоичныеДанныеСертификатаНаСервере()
	
	ДвоичныеДанныеСертификата = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДвоичныеДанныеСертификата(Объект.ОтпечатокСертификата, Объект.ТипМодуляКриптографии);
	АдресСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	
	ПроверитьСертификатЧерезДиадок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДвоичныеДанныеСертификатаНаКлиенте()
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеСертификатаЗавершение", ЭтаФорма);
				
	КонтурЛогистика_КриптографияКлиент.ПолучитьДанныеСертификата(Оповещение, 
																Объект.ОтпечатокСертификата,
																Объект.ТипМодуляКриптографии,
																Объект.ИмяМодуляКриптографии);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДвоичныеДанныеСертификатаНаКлиентеСинхр()
	
	ДвоичныеДанныеСертификата = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДвоичныеДанныеСертификата(Объект.ОтпечатокСертификата, Объект.ТипМодуляКриптографии);
	АдресСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	
	ПроверитьСертификатЧерезДиадок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСертификатаЗавершение(ДвоичныеДанныеСертификата, ДополнительныеПараметры) Экспорт
	
	АдресСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
	
	ПроверитьСертификатЧерезДиадок();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Перезаполнен = Ложь;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда 
		
		ПолучитьДанныеСертификатаСинх(Перезаполнен);

	Иначе
		
		#Если Не ТолстыйКлиентОбычноеПриложение И Не ТолстыйКлиентУправляемоеПриложение Тогда
			
			Если Объект.СертификатНаСервере Тогда
				
				Сертификаты = КонтурЛогистика_КриптографияСервер.ПолучитьСписокЛокальныхСертификатов();		
				ПерезаполнитьСертификат(Сертификаты, Перезаполнен);	
				
				Если Перезаполнен Тогда				
					ПолучитьДвоичныеДанныеСертификатаНаСервере();				
				КонецЕсли;
				
			Иначе			
				
				Оповещение = Новый ОписаниеОповещения("ПолучитьСертификатАсинхронноЗавершение", ЭтаФорма);
				КонтурЛогистика_КриптографияКлиент.ПолучитьСписокЛокальныхСертификатовАсинхронно(Оповещение);	
				
			КонецЕсли;
			
		#Иначе
			
			ПолучитьДанныеСертификатаСинх(Перезаполнен);
			
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСертификатаСинх(Перезаполнен)
	
	Перем Сертификаты;
	
	Если Объект.СертификатНаСервере Тогда
		
		Сертификаты = КонтурЛогистика_КриптографияСервер.ПолучитьСписокЛокальныхСертификатов();		
		ПерезаполнитьСертификат(Сертификаты, Перезаполнен);	
		
		Если Перезаполнен Тогда				
			ПолучитьДвоичныеДанныеСертификатаНаСервере();				
		КонецЕсли;
		
	Иначе
		
		Сертификаты = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьСписокЛокальныхСертификатов();		
		ПерезаполнитьСертификат(Сертификаты, Перезаполнен);
		
		Если Перезаполнен Тогда				
			ПолучитьДвоичныеДанныеСертификатаНаКлиентеСинхр();				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСертификатАсинхронноЗавершение(Сертификаты, ДополнительныеПараметры) Экспорт
	
	Перезаполнен = Ложь;
	
	ПерезаполнитьСертификат(Сертификаты, Перезаполнен);
	
	Если Перезаполнен Тогда		
		ПолучитьДвоичныеДанныеСертификатаНаКлиенте();																	
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСертификат(Сертификаты, Перезаполнен)
	
	Для каждого Сертификат Из Сертификаты Цикл
		
		Если НРег(Сертификат.ОтпечатокСертификата) = НРег(Объект.ОтпечатокСертификата) Тогда
			
			ЗаполнитьСертификатДанными(Сертификат);
			
			ДвоичныеДанныеСертификата = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДвоичныеДанныеСертификата(Объект.ОтпечатокСертификата, Объект.ТипМодуляКриптографии);
			АдресСертификата = ПоместитьВоВременноеХранилище(ДвоичныеДанныеСертификата, УникальныйИдентификатор);
			
			ПроверкаПройдена = Ложь;
			ТекстПредупреждения = "Необходимо выполнить проверку сертификата!";
			УправлениеЭлементамиФормы();
			
			Перезаполнен = Истина;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Перезаполнен Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Сертификат с отпечатком " + Объект.ОтпечатокСертификата + " не найден.");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаСертификата

&НаКлиенте
Процедура ЗаполнитьСписокТиповМодуляКриптографииДляВыбора()
	
	ТипыМодуляКриптографииДляВыбора = Новый Массив;
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		Элементы.ТипПрограммыЭП.СписокВыбора.Добавить(ТипМодуля.ИмяДляВыбора, );	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипПрограммыЭППриОткрытии()
	
	ТипыМодуляКриптографии = КонтурЛогистика_КриптографияКлиентПовтИсп.ПолучитьТипыМодуляКриптографии();
	Для каждого ТипМодуля Из ТипыМодуляКриптографии Цикл
		
		Если ТипМодуля.ТипМодуляКриптографии = Объект.ТипМодуляКриптографии 
			И ТипМодуля.ИмяМодуляКриптографии = Объект.ИмяМодуляКриптографии Тогда
			
			ТипПрограммыЭП = ТипМодуля.ИмяДляВыбора;			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипПрограммыЭППоУмолчанию()
	
	ТипПрограммыЭППоУмолчанию = КонтурЛогистика_КриптографияСервер.ПолучитьТипыМодуляКриптографии()[0];
	ТипПрограммыЭП = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
	Объект.ТипМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ТипМодуляКриптографии;
	Объект.ИмяМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСКриптографиейПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РасширениеРаботыСФайламиПодключено", ЭтаФорма, ДополнительныеПараметры);	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиПодключено(Подключено, ДополнительныеПараметры) Экспорт
 
	Если НЕ Подключено Тогда
	 
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
		Возврат;
		  
	КонецЕсли;
	
	ДополнительныеПараметры.ОповещениеИнициализацииМенеджераКриптографии.ДополнительныеПараметры.Вставить("ОповещениеПроверкаПодписи", ДополнительныеПараметры.ОповещениеПроверкаПодписи);
	ДополнительныеПараметры.ОповещениеИнициализацииМенеджераКриптографии.ДополнительныеПараметры.Вставить("ЗначениеПЗК", ДополнительныеПараметры.ЗначениеПЗК);
		
	КонтурЛогистика_КриптографияКлиент.НачатьИнициализациюМенеджераКриптографии(ДополнительныеПараметры.ОповещениеИнициализацииМенеджераКриптографии, 
																				Объект.ТипМодуляКриптографии, 
																				Объект.ИмяМодуляКриптографии, 
																				Объект.ВводитьПарольВПрограммеЭлектроннойПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииЗавершение(МенеджерКриптографии, ДополнительныеПараметры) Экспорт
	
	ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИнициализациюМенеджераКриптографииОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма, ДополнительныеПараметры);
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеЗавершение(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеКаталогаВременныхФайлов(ДополнительныеПараметры)      
	
	Оповещение = Новый ОписаниеОповещения("НачатьПолучениеКаталогаВременныхФайловЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеКаталогаВременныхФайловЗавершение(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
	ИмяПромежуточногоФайла = СтрЗаменить(ИмяКаталогаВременныхФайлов + "\" + ИмяФайла, "\\", "\");
	ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
	
	Оповещение = Новый ОписаниеОповещения("НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение", ЭтаФорма, ДополнительныеПараметры);	
	НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ИмяПромежуточногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеДвоичныхДанныхИзФайлаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	ТипМодуля =  Объект.ТипМодуляКриптографии;
	ИмяМодуля =  Объект.ИмяМодуляКриптографии;
	
	КонтурЛогистика_КриптографияКлиент.ПодписатьАсинхронно(ДополнительныеПараметры.ОповещениеПроверкаПодписи, ДвоичныеДанные, Объект.ОтпечатокСертификата, 
		ТипМодуля, ИмяМодуля, ДополнительныеПараметры.ЗначениеПЗК, Объект.ВводитьПарольВПрограммеЭлектроннойПодписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершение(ДанныеПодписи, ДополнительныеПараметры) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
	
	ПроверкаПройдена = Истина;
	ТекстПредупреждения = "Проверка пройдена";
	
	УправлениеЭлементамиФормы();
	
	ПроверитьСертификатЧерезДиадок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПодписиЗавершениеОшибка(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
	
	ВывестиОшибку(Оповещение, ИнформацияОбОшибке);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибку(Оповещение, ИнформацияОбОшибке)
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);			
	Иначе
		ТекстОшибки = ИнформацияОбОшибке;
	КонецЕсли;
	
	Если Найти(ТекстОшибки, "контекст был получен в ограниченном режиме") Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + "- Убедитесь, что вводится правильный пароль";
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ОбработатьОшибку("ПроверитьСертификат", ТекстОшибки, Объект.Ссылка);
	
	ПоказатьПредупреждение(Оповещение, ТекстОшибки);
	
	ПроверкаПройдена = Ложь;
	ТекстПредупреждения = "Проверка сертификата не пройдена!";
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеФайловЗавершение(ДополнительныеПараметры) Экспорт	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПометкаУдаленияЭлементаСправочника" Тогда
		ЭтаФорма.Прочитать();		
		Элементы.ГруппаПометкаУдаление.Видимость = Объект.ПометкаУдаления;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройкиПодписания(Команда)
	
	Если ЭтоНовый И Модифицированность Тогда
		
		Сообщить("Чтобы посмотреть настройки подписания необходимо записать сертификат");	
		
	Иначе
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Сертификат", Объект.Ссылка);
		
 		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
						"РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаСписка",
						Параметрыформы,
						ЭтаФорма,
						ЭтаФорма);
						
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСертификатЧерезДиадок()
	
	Если ЭтоНовый Тогда
		Объект.Наименование = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.СформироватьНаименованиеСертификата(Объект);
	КонецЕсли;
	
	Если Объект.ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.Тестовая Тогда
		Возврат;		
	КонецЕсли;
	
	ДвоичныеДанныеСертификата = Объект.Ссылка.ДанныеСертификата.Получить();
	Если Не ЗначениеЗаполнено(ДвоичныеДанныеСертификата) Тогда
		ДвоичныеДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) Тогда		
		
		НашаОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеСертификата) И ЗначениеЗаполнено(НашаОрганизация) И ЗначениеЗаполнено(НашаОрганизация.ID) Тогда
			
			Результат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ВыполнитьПроверкуСертификатаЧерезДиадок(НашаОрганизация.ID, ДвоичныеДанныеСертификата);							
			ЗаполнитьЗначенияСвойств(Объект, Результат);
			
			Элементы.ТекстДатаПроверкиТипаПодписи.Заголовок = "(на " + Строка(Объект.ДатаПроверкиТипаПодписи) + ")";
						
		КонецЕсли;		
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПроверкиСертификата(Результат)
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("КодОшибки") И ЗначениеЗаполнено(Результат.КодОшибки) Тогда
			
		ТипОшибки = КонтурЛогистика_КриптографияКлиентСервер.ТипОшибкиКриптографии(Результат.КодОшибки, Объект.СертификатНаСервере);
		
		ПараметрыФормы = Новый Структура("ТипОшибки, ОписаниеОшибки, Сертификат, Документ", 
			ТипОшибки, Результат.ОписаниеОшибки, Объект.Ссылка);
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ОписаниеОшибкиСРешением", ПараметрыФормы,,
			КонтурЛогистика_ПанельОшибокКлиент, "ОбработчикОписаниеОшибкиСРешением");
		КонтурЛогистика_Метрика.ОбработатьОшибку("ПроверитьСертификат", Результат.ОписаниеОшибки, Объект.Ссылка);
		
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПоказатьПредупреждениеЗавершение", ЭтаФорма);
		ПоказатьПредупреждение(Оповещение, "Проверка пройдена успешно!");
		
		ПроверкаПройдена = Истина;
		ТекстПредупреждения = "Проверка пройдена";
		
		УправлениеЭлементамиФормы();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
